# Pandas

In [2]:
import pandas as pd

# 1. Data Type

In [36]:
# Data Type 1 : Series
pd.Series()
animals_series = pd.Series(["dog", "cat", "iguana"])
animals_series[2:]
list(animals_series)

['dog', 'cat', 'iguana']

In [41]:
# Data Type 2 : DataFrame

# make DataFrame as columns name
df = pd.DataFrame(columns=["Email","Name"])

# make DataFrame as dictionary list
name = ["Doojin Park","Radajin"]
email = ["pdj1224@gmail.com","radajin1224@gmail.com"]
df = pd.DataFrame({"Name":name,"Email":email})
df

                   Email         Name
0      pdj1224@gmail.com  Doojin Park
1  radajin1224@gmail.com      Radajin

In [33]:
# row of data frame is series
type(df.loc[1])

pandas.core.series.Series

In [34]:
# get column from DataFrame
print(df["Name"])
print(df.Name)

0    Doojin Park
1        Radajin
Name: Name, dtype: object
0    Doojin Park
1        Radajin
Name: Name, dtype: object

In [35]:
# get row from Data Frame
df.loc[1]

Email    radajin1224@gmail.com
Name                   Radajin
Name: 1, dtype: object

# 2. Insert

In [40]:
# insert dictionary data
df.loc[2] = {"Name":"Ansu Charn", "Email":"dobestan@gmail.com"}
df

                   Email         Name
0      pdj1224@gmail.com  Doojin Park
1  radajin1224@gmail.com      Radajin
2     dobestan@gmail.com   Ansu Charn

In [47]:
# add Column
df["Address"] = ""

# remove Column
# inplace=True : adapt DataFrame directly
# axis=1 : append width (default : axis=0)
df.drop('Address', axis=1, inplace=True) 

# insert new Column Data (using functional programing)

# first method
def get_address(name):
    return "Mapo Cobion (" + name + ")"
df["Address"] = df["Name"].apply(get_address)

# second method (using lambda)
df["Address"] = df["Name"].apply(lambda name: "Mapo Cobion (" + name + ")")

# 3. Append

In [51]:
# make sample data
a_df = pd.DataFrame([
        {
            "Name" : "A 회사 직원 (1)",
            "Age" : 30,
        },
        {
            "Name" : "A 회사 직원 (2)",
            "Age" : 28,
        }
    ])

b_df = pd.DataFrame([
        {
            "Name" : "B 회사 직원 (1)",
            "Age" : 32,
        },
        {
            "Name" : "B 회사 직원 (2)",
            "Age" : 26,
        }
    ])

print(a_df)
print(b_df)

   Age         Name
0   30  A 회사 직원 (1)
1   28  A 회사 직원 (2)
   Age         Name
0   32  B 회사 직원 (1)
1   26  B 회사 직원 (2)

In [52]:
# append
ab_df = a_df.append(b_df)
ab_df

   Age         Name
0   30  A 회사 직원 (1)
1   28  A 회사 직원 (2)
0   32  B 회사 직원 (1)
1   26  B 회사 직원 (2)

In [53]:
# reindex
ab_df.reset_index(drop=True, inplace=True)
ab_df

   Age         Name
0   30  A 회사 직원 (1)
1   28  A 회사 직원 (2)
2   32  B 회사 직원 (1)
3   26  B 회사 직원 (2)

# 4. Concat

In [55]:
# make sample data
k_df = pd.DataFrame([
        {
            "Name" : "Kakao 회사 직원 (1)",
            "Age" : 30,
        },
        {
            "Name" : "Kakao 회사 직원 (2)",
            "Age" : 28,
        }
    ])

d_df = pd.DataFrame([
        {
            "Name" : "Daum 회사 직원 (1)",
            "Age" : 32,
        },
        {
            "Name" : "Daum 회사 직원 (2)",
            "Age" : 26,
        }
    ])

k_df["Company"] = "Kakao"
d_df["Company"] = "Daum"

print(k_df)
print(d_df)

   Age             Name Company
0   30  Kakao 회사 직원 (1)   Kakao
1   28  Kakao 회사 직원 (2)   Kakao
   Age            Name Company
0   32  Daum 회사 직원 (1)    Daum
1   26  Daum 회사 직원 (2)    Daum

In [57]:
# concat (k_df & d_df)
kd_df = pd.concat([k_df, d_df]).reset_index(drop=True)
kd_df

   Age             Name Company
0   30  Kakao 회사 직원 (1)   Kakao
1   28  Kakao 회사 직원 (2)   Kakao
2   32   Daum 회사 직원 (1)    Daum
3   26   Daum 회사 직원 (2)    Daum

In [58]:
# concat with keys
ab_df = pd.concat([a_df, b_df], keys=["Kakao", "Daum"])
ab_df

         Age         Name
Kakao 0   30  A 회사 직원 (1)
      1   28  A 회사 직원 (2)
Daum  0   32  B 회사 직원 (1)
      1   26  B 회사 직원 (2)

In [63]:
# select Kakao second employer's name
ab_df.loc["Kakao"].loc[1]["Name"]

'A 회사 직원 (2)'

In [67]:
# concat columns
name_age_df = pd.DataFrame([
        {
            "Name":"Doojin",
            "Email":"pdj@gmail.com",
        },
        {
            "Name":"Rada",
            "Email":"radajin@gmail.com",
        },
    ])

address = pd.DataFrame([
        {
            "Address":"Seoul",
        },
        {
            "Address":"Busan",
        },
    ])

print(name_age_df)
print(address)

# axis=1 width concat, axis=0 height concat
pd.concat([name_age_df, address], axis=1)

               Email    Name
0      pdj@gmail.com  Doojin
1  radajin@gmail.com    Rada
  Address
0   Seoul
1   Busan

               Email    Name Address
0      pdj@gmail.com  Doojin   Seoul
1  radajin@gmail.com    Rada   Busan

# 5. Iterrows (for)

In [71]:
for idx, row in ab_df.iterrows():
    print(idx)
    print("-" * 30)
    print(row)
    print("=" * 30)

('Kakao', 0)
------------------------------
Age              30
Name    A 회사 직원 (1)
Name: (Kakao, 0), dtype: object
==============================
('Kakao', 1)
------------------------------
Age              28
Name    A 회사 직원 (2)
Name: (Kakao, 1), dtype: object
==============================
('Daum', 0)
------------------------------
Age              32
Name    B 회사 직원 (1)
Name: (Daum, 0), dtype: object
==============================
('Daum', 1)
------------------------------
Age              26
Name    B 회사 직원 (2)
Name: (Daum, 1), dtype: object
==============================

# 6. Groupby

In [75]:
# make sample data
df = pd.DataFrame(columns=["si","dong"])
df.loc[len(df)] = ["seoul","sinsa"]
df.loc[len(df)] = ["seoul","mangwon"]
df.loc[len(df)] = ["busan","1dong"]
df.loc[len(df)] = ["busan","2dong"]
df.loc[len(df)] = ["kyungki","suwon"]
df.loc[len(df)] = ["kyungki","jungja"]
df

        si     dong
0    seoul    sinsa
1    seoul  mangwon
2    busan    1dong
3    busan    2dong
4  kyungki    suwon
5  kyungki   jungja

In [77]:
# unique (using python list, using numpy ndarray)
list_df = list(set(list(groupby_df["si"]))) # Python list
print(list_df)

list_df = df["si"].unique() # numpy ndarray (bertter : fast)
print(list_df)

['kyungki', 'busan', 'seoul']
['seoul' 'busan' 'kyungki']

In [82]:
# groupby
print(df.groupby("si").groups)
df.groupby("si").get_group("seoul")

{'kyungki': [4, 5], 'busan': [2, 3], 'seoul': [0, 1]}

      si     dong
0  seoul    sinsa
1  seoul  mangwon

# 7. Merge

In [85]:
# make sample data (users)
users_df = pd.DataFrame(columns=["Id","Name","Age","Signup Date"])
users_df.loc[len(users_df)] = [str(len(users_df)+1), "Doojin", "35", "2016-01-01"]
users_df.loc[len(users_df)] = [str(len(users_df)+1), "Alad", "28", "2016-04-21"]
users_df.loc[len(users_df)] = [str(len(users_df)+1), "Rada", "30", "2016-03-12"]
users_df

  Id    Name Age Signup Date
0  1  Doojin  35  2016-01-01
1  2    Alad  28  2016-04-21
2  3    Rada  30  2016-03-12

In [86]:
# make sample data (purchase)
purchase_df = pd.DataFrame(columns=["UserId", "Amount", "Purchase Date"])
purchase_df.loc[len(purchase_df)] = ["1", "4000", "2016-01-02"]
purchase_df.loc[len(purchase_df)] = ["3", "14000", "2016-05-03"]
purchase_df.loc[len(purchase_df)] = ["2", "8000", "2016-04-29"]
purchase_df.loc[len(purchase_df)] = ["2", "42000", "2016-04-04"]
purchase_df.loc[len(purchase_df)] = ["2", "23000", "2016-03-05"]
purchase_df.loc[len(purchase_df)] = ["1", "2000", "2016-02-02"]
purchase_df.loc[len(purchase_df)] = ["3", "9000", "2016-05-25"]
purchase_df

  UserId Amount Purchase Date
0      1   4000    2016-01-02
1      3  14000    2016-05-03
2      2   8000    2016-04-29
3      2  42000    2016-04-04
4      2  23000    2016-03-05
5      1   2000    2016-02-02
6      3   9000    2016-05-25

In [93]:
# merge (different key : UserId, Id)
purchase_df.merge(users_df, left_on="UserId", right_on="Id")[["Id", "Amount", "Purchase Date", "Name", "Age", "Signup Date"]]

  Id Amount Purchase Date    Name Age Signup Date
0  1   4000    2016-01-02  Doojin  35  2016-01-01
1  1   2000    2016-02-02  Doojin  35  2016-01-01
2  3  14000    2016-05-03    Rada  30  2016-03-12
3  3   9000    2016-05-25    Rada  30  2016-03-12
4  2   8000    2016-04-29    Alad  28  2016-04-21
5  2  42000    2016-04-04    Alad  28  2016-04-21
6  2  23000    2016-03-05    Alad  28  2016-04-21

In [94]:
# rename column
rename_users_df = users_df.rename(columns={"Id":"UserId"}) 

# merge (different same key : UserId)
pd.merge(purchase_df, rename_users_df)[["UserId", "Amount", "Purchase Date", "Name", "Age", "Signup Date"]]

  UserId Amount Purchase Date    Name Age Signup Date
0      1   4000    2016-01-02  Doojin  35  2016-01-01
1      1   2000    2016-02-02  Doojin  35  2016-01-01
2      3  14000    2016-05-03    Rada  30  2016-03-12
3      3   9000    2016-05-25    Rada  30  2016-03-12
4      2   8000    2016-04-29    Alad  28  2016-04-21
5      2  42000    2016-04-04    Alad  28  2016-04-21
6      2  23000    2016-03-05    Alad  28  2016-04-21

# 8. File Input Output

In [110]:
# make sample data
df = pd.DataFrame([{"Name":"Doojin", "Age":35}, {"Name":"Hyojin", "Age":31}, {"Name":"Rada", "Age":30}])
df

   Age    Name
0   35  Doojin
1   31  Hyojin
2   30    Rada

In [111]:
# input DataFrame to csv and Save
df.to_csv("./sample.csv", index=False)

In [112]:
# Output csv to DataFrame
df = pd.read_csv("./sample.csv")
df

   Age    Name
0   35  Doojin
1   31  Hyojin
2   30    Rada

In [113]:
# rename columns
df.rename(columns={"Age":"나이","Name":"이름"}, inplace=True)
df

   나이      이름
0  35  Doojin
1  31  Hyojin
2  30    Rada

In [115]:
# string contains
is_contain = df["이름"].str.contains("jin")
df[is_contain]

   나이      이름
0  35  Doojin
1  31  Hyojin

In [121]:
# sorting
# ascending (True : 오름차순(default), False : 내림차순)
df.sort_values("나이", ascending=True).reset_index(drop=True, inplace=True)
df

   나이      이름
0  35  Doojin
1  31  Hyojin
2  30    Rada